print(1,3,5)
print("아무개씨", "안녕하세요")

print("-"*20)

print(1+3+5)
print("1"+"3"+"5") #문자열 사이 +는 띄어쓰기 없이 연결하여 출력

#print(1+"홍길동") #오류. +는 자료형(타입)이 같아야 함
print(str(1)+"홍길동") #자료형 변환 시 사용 가능
print(1, "홍길동") #,는 상관X

print("-"*20)

#서식 출력 %d(정수) / %f(실수) / %c(한 글자<<잘 안 씀) / %s(문자열) 
print("정수:%d, 실수:%f, 문자열:%s" %(5, 31.4,"홍길동"))

#자리 지정 %nd(n자리 정수, ex:%5d) / %nf(n자리 실수) / %ns(n자리수 문자열)
print("정수:%3d, 실수:%.4f, 문자열:%5s" %(5, 3.14,"홍길동")) #실수의 .n 은 소수점 n번쨰 자리까지 출력을 의미
print("소수점 둘째자리까지 : %.2f, %.2f, %.2f" %(5.3492, 1250.0228, 329.1844))

print("-"*20)

#sep 속성
# 분리 문자 설정 - 기본적으로는 분리문자로 공백이 들어가 있음
print(5,7.7,"와샌즈", True, sep=" ")
print(5,7.7,"와샌즈", True, sep=" / ")
print(5,7.7,"와샌즈", True, sep=", ")

print("-"*20)

print("오늘은\n화요일\n공부하는날")
print("오늘은\t화요일\t공부하는날")

#end 속성
print("Hello", end='\n')
print("python", end="")
print("티알피지", end="\n")
print("짱좋아", end="\t")
print("헤헤")

print("-"*20)

print("{},{},{}".format(100, "야르", 3.141592))
print("{1},{2},{0}".format(100, "야르", 3.141592))
print("이름:{}, 나이:{}, data ={}," .format("홍길동", 21, 322.9302))
print("이름:{0}, 나이:{2}, data ={1}," .format("홍길동", 322.9302, 21))

print("원주율 = ", format(3.141592))
print("원주율 = {}" .format(3.141592))
print("원주율 = ", format(3.141592, '.2f'))
print("금액 : ", format(10000, "7d"))
print("금액 : ", format(5000, "7d"))
print("금액 : ", format(38278592, "3,d"))

print("-"*20)

#f-strng
#문자열을 만드는 따옴표 앞에 f(대문자도 가능)를 붙이고, 문자열 내부에 {변수명}을 넣는 방식

print("두 수의 합은", 3+5, "입니다")
print("두 수의 합은"+str(3+5)+"입니다")
print(f"두 수의 합은 {3+5} 입니다")