"""
문제

입력
- 경기장은 어디입니까?
- 이긴 팀은 어디입니까?
- 진 팀은 어디입니까?
- 스코어는 몇 대 몇 입니까?

출력
==================================================
오늘 OO 경기장에서 야구 경기가 열렸습니다.
xx와 ㅁㅁ의 치열한 공방전이 펼쳐졌습니다.
결국 {이긴 팀}은 {진 팀}을 {스코어}로 이겼습니다.
==================================================
"""

place = input("경기장은 어디입니까? : ")
win = input("이긴 팀은 어디입니까? : ")
lose = input("진 팀은 어디입니까? : ")
score = input("스코어는 몇 대 몇 입니까?(1:2 형식으로 입력) : ")

result = f"""\
오늘 {place} 경기장에서 야구 경기가 열렸습니다.
{lose}와 {win}의 치열한 공방전이 펼쳐졌습니다.
결국 {win}은 {lose}를 {score}으로 이겼습니다.\
"""
print("="*50)
print(result)
print("="*50)