a = [1,2,3]
print(a)

#특정 위치의 요소 하나를 통째로 교체
a[1] = ["a", "b", "c"]
print(a[0])
print(a[1])
print(a[1][0])

b = [1,2,3,4,5]
b [1:3] = [1000]
print(b)

#슬라이싱 : 지정한 범위 요소를 제거하고 새로운 요소 삽입
b[1:2] = ["a","b","c"]
# b[1:2] = [["a","b","c"]] #리스트 안에 리스트로 넣는 법
print(b)

#리스트로 오늘의 명언 10개 넣기. 그 중에 랜덤으로 하나 출력하기

coment =["삶이 있는 한 희망은 있다", "산다는것 그것은 치열한 전투이다", "언제나 현재에 집중할수 있다면 행복할것이다", "신은 용기있는자를 결코 버리지 않는다", "피할수 없으면 즐겨라", "내일은 내일의 태양이 뜬다", "자신감 있는 표정을 지으면 자신감이 생긴다", "눈물과 더불어 빵을 먹어 보지 않은 자는 인생의 참다운 맛을 모른다", "그대의 하루 하루를 그대의 마지막 날이라고 생각하라"]

import random

print(coment[random.randrange(len(coment))])

